Revit 2027 API
SymbolTypeId.DegreeCInterval Property
 Symbol °C, indicating unit Celsius interval.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DegreeCInterval { get; }
Public Shared ReadOnly Property DegreeCInterval As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DegreeCInterval {
	ForgeTypeId^ get ();
}
static member DegreeCInterval : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SymbolTypeId Class
Autodesk.Revit.DB Namespace